# risk/keywords.py

RISK_KEYWORDS = {
    "en": [
        "penalty", "fine", "termination", "liability",
        "binding", "irrevocable", "exclusive rights",
        "legal action", "breach", "compensation",
        "sole discretion", "unilateral",
        "non-refundable", "reject",
        "quality not satisfactory",
        "arbitration", "force majeure",
        "indemnify", "withhold payment", "blacklist"
    ],

    "hi": [
        "जुर्माना", "दंड", "समाप्ति", "जिम्मेदारी",
        "कानूनी कार्रवाई", "उल्लंघन", "क्षतिपूर्ति",
        "बाध्यकारी", "अपरिवर्तनीय",
        "एकतरफा", "गुणवत्ता अस्वीकार्य",
        "भुगतान रोकना", "मध्यस्थता",
        "फसल अस्वीकार", "हर्जाना",
        "अनुबंध समाप्त", "देरी से भुगतान",
        "बलपूर्वक", "काली सूची"
    ],

    "gu": [
        "દંડ", "જવાબદારી", "કાયદેસર કાર્યવાહી",
        "ભંગ", "ક્ષતિપૂર્તિ", "બંધનકારક",
        "એકતરફી", "ચુકવણી રોકી",
        "ફસલ નકારી", "મધ્યસ્થી",
        "વિલંબિત ચુકવણી", "બ્લેકલિસ્ટ",
        "કરાર સમાપ્ત", "જપ્ત",
        "હર્જાના", "જવાબદેહ",
        "અધિકાર સીમિત", "નિયંત્રણ",
        "અપરિવર્તનીય", "બળજબરી"
    ],

    "pa": [
        "ਜੁਰਮਾਨਾ", "ਸਜ਼ਾ", "ਜ਼ਿੰਮੇਵਾਰੀ",
        "ਕਾਨੂੰਨੀ ਕਾਰਵਾਈ", "ਉਲੰਘਣਾ", "ਮੁਆਵਜ਼ਾ",
        "ਇਕਤਰਫਾ", "ਭੁਗਤਾਨ ਰੋਕ",
        "ਫਸਲ ਰੱਦ", "ਮੱਧਸਥਤਾ",
        "ਦੇਰੀ ਨਾਲ ਭੁਗਤਾਨ", "ਕਾਲੀ ਸੂਚੀ",
        "ਕਰਾਰ ਸਮਾਪਤ", "ਜ਼ਬਤ",
        "ਹਾਨੀ", "ਜਵਾਬਦੇਹ",
        "ਅਧਿਕਾਰ ਸੀਮਿਤ", "ਨਿਯੰਤਰਣ",
        "ਅਟੱਲ", "ਜ਼ਬਰਦਸਤੀ"
    ],

    "kn": [
        "ದಂಡ", "ಹೊಣೆಗಾರಿಕೆ", "ಕಾನೂನು ಕ್ರಮ",
        "ಉಲ್ಲಂಘನೆ", "ಪರಿಹಾರ", "ಬಾಧ್ಯ",
        "ಏಕಪಕ್ಷೀಯ", "ಪಾವತಿ ತಡೆ",
        "ಬೆಳೆ ತಿರಸ್ಕಾರ", "ಮಧ್ಯಸ್ಥಿಕೆ",
        "ತಡ ಪಾವತಿ", "ಕಪ್ಪುಪಟ್ಟಿ",
        "ಒಪ್ಪಂದ ರದ್ದು", "ಜಪ್ತಿ",
        "ನಷ್ಟ", "ಜವಾಬ್ದಾರಿ",
        "ಹಕ್ಕು ಮಿತಿ", "ನಿಯಂತ್ರಣ",
        "ಅವಿರತ", "ಬಲವಂತ"
    ],

    "bh": [
        "जुर्माना", "करार", "जिम्मेदारी",
        "मुकदमा", "हर्जाना", "कानूनी",
        "एकतरफा", "भुगतान रोके",
        "फसल खारिज", "देरी भुगतान",
        "काली सूची", "जबरदस्ती",
        "अनुबंध खत्म", "नुकसान",
        "बांधने वाला", "मुआवजा",
        "धोखा", "संपत्ति जब्त",
        "रोक", "शर्त कड़ी"
    ]
}


# Higher weight = more dangerous clause
RISK_WEIGHTS = {
    "sole discretion": 3,
    "unilateral": 3,
    "non-refundable": 2,
    "reject": 3,
    "withhold payment": 3,
    "blacklist": 2,
    "exclusive rights": 2,
    "irrevocable": 2,
    "indemnify": 3,
    "termination": 2,
    "liability": 2,
    "penalty": 1,
    "fine": 1,
}
